In [2]:
import numpy as np
import pandas as pd

In [4]:
dictin1 = { "Name" : ["Ahmet", "Metmet", "Zeynep", "Onur"], 
          "Spor" : ["Running", "Swimming", "Running", "Basketball"],
         "Calorie" : [110,200,300,400]}

In [5]:
dataFrame1 = pd.DataFrame(dictin1,index = [0,1,2,3])

In [6]:
dataFrame1

     Name        Spor  Calorie
0   Ahmet     Running      110
1  Metmet    Swimming      200
2  Zeynep     Running      300
3    Onur  Basketball      400

In [7]:
dictin2 = { "Name" : ["Osman", "Levent", "Atlas", "Fatma"], 
          "Spor" : ["Running", "Swimming", "Running", "Basketball"],
         "Calorie" : [200,100,50,300]}
dataFrame2 = pd.DataFrame(dictin2,index = [4,5,6,7])

In [8]:
dictin3 = { "Name" : ["Ayse", "Mahmut", "Duygu", "Nur"], 
          "Spor" : ["Running", "Swimming", "Badminton", "Tenis"],
         "Calorie" : [300,400,510,240]}
dataFrame3 = pd.DataFrame(dictin3,index = [8,9,10,11])

In [9]:
dataFrame3

      Name       Spor  Calorie
8     Ayse    Running      300
9   Mahmut   Swimming      400
10   Duygu  Badminton      510
11     Nur      Tenis      240

## Concatenation

In [10]:
pd.concat([dataFrame1,dataFrame2,dataFrame3]) # axis = 0
# if we want to put columns near, it will be axis = 1

      Name        Spor  Calorie
0    Ahmet     Running      110
1   Metmet    Swimming      200
2   Zeynep     Running      300
3     Onur  Basketball      400
4    Osman     Running      200
5   Levent    Swimming      100
6    Atlas     Running       50
7    Fatma  Basketball      300
8     Ayse     Running      300
9   Mahmut    Swimming      400
10   Duygu   Badminton      510
11     Nur       Tenis      240

## Merge

In [11]:
mergeDic1 = {"Name" : ["Ahmet","Mehmet","Zeynep","Onur"],
            "Spor" : ["Running","Swimming","Running","Basketball"]
            }
mergeDataFrame1 = pd.DataFrame(mergeDic1)

In [12]:
mergeDataFrame1

     Name        Spor
0   Ahmet     Running
1  Mehmet    Swimming
2  Zeynep     Running
3    Onur  Basketball

In [13]:
mergeDic2 = {"Name" : ["Ahmet","Mehmet","Zeynep","Onur"],
            "Calorie" : [100,200,300,400]
            }
mergeDataFrame2 = pd.DataFrame(mergeDic2)

In [14]:
mergeDataFrame2

     Name  Calorie
0   Ahmet      100
1  Mehmet      200
2  Zeynep      300
3    Onur      400

In [15]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Name")

     Name        Spor  Calorie
0   Ahmet     Running      100
1  Mehmet    Swimming      200
2  Zeynep     Running      300
3    Onur  Basketball      400

In [16]:
salaryDict = {"Name" : ["Onur","Ahmet","Duygu","Ipek"],
             "Departman" : ["IT", "Sales", "Marketing", "IT"],
             "Salary" : [200,300,400,500]}
salaryDataFrame = pd.DataFrame(salaryDict)

In [17]:
print(salaryDataFrame)

    Name  Departman  Salary
0   Onur         IT     200
1  Ahmet      Sales     300
2  Duygu  Marketing     400
3   Ipek         IT     500

In [18]:
salaryDataFrame["Departman"].unique() # unique departman

array(['IT', 'Sales', 'Marketing'], dtype=object)

In [19]:
salaryDataFrame["Departman"].nunique() # Number of unique departman

3

In [20]:
salaryDataFrame["Departman"].value_counts() # how many people are in each departman

IT           2
Sales        1
Marketing    1
Name: Departman, dtype: int64

In [24]:
def grossNet(salary):
    return salary * 0.66

In [25]:
salaryDataFrame["Salary"].apply(grossNet)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Salary, dtype: float64

In [26]:
salaryDataFrame.isnull() # finds null data

    Name  Departman  Salary
0  False      False   False
1  False      False   False
2  False      False   False
3  False      False   False

In [30]:
newData = {"Characters class" : ["South Park", "South Park", "Simpson", "Simpson","Simpson"],
          "Name" : ["Cartman", "Kenny", "Homer", "Bart","Bart"],
          "Age" : [9,10,50,20,10]}
characterDF = pd.DataFrame(newData)

In [31]:
characterDF

  Characters class     Name  Age
0       South Park  Cartman    9
1       South Park    Kenny   10
2          Simpson    Homer   50
3          Simpson     Bart   20
4          Simpson     Bart   10

In [33]:
#characterDF.pivot_table(values = "Age", index=["Characters class","Name"])
# it gets avg if you don't put any data
characterDF.pivot_table(values = "Age", index=["Characters class","Name"], aggfunc=np.sum)

                          Age
Characters class Name
Simpson          Bart      30
                 Homer     50
South Park       Cartman    9
                 Kenny     10